PANDAS

In [311]:
import numpy as np
import pandas as pd

SERIES

In [312]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [313]:
d

{'a': 10, 'b': 20, 'c': 30}

In [314]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [315]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [316]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [317]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [318]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [319]:
ser1=pd.Series([1,2,3,4],['USA','JAPAN','USSR','GERMANY'])
ser1

USA        1
JAPAN      2
USSR       3
GERMANY    4
dtype: int64

In [320]:
ser2=pd.Series([1,2,5,4],['USA','JAPAN','ITALY','GERMANY'])

In [321]:
ser2

USA        1
JAPAN      2
ITALY      5
GERMANY    4
dtype: int64

In [322]:
ser1+ser2

GERMANY    8.0
ITALY      NaN
JAPAN      4.0
USA        2.0
USSR       NaN
dtype: float64

DATAFRAMES

In [323]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [324]:
np.random.seed(101)

In [325]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [326]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [327]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [328]:
type(df['W'])

pandas.core.series.Series

In [329]:
type(df)

pandas.core.frame.DataFrame

In [330]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [331]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

Creation of new column

In [332]:
df['new']=df['W']+df['Y']

In [333]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [334]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [335]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [336]:
df.drop('new',axis=1,inplace=True)

In [337]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [338]:
df.drop('E',)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [339]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [340]:
df.shape

(5, 4)

In [341]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [342]:
#Rows

In [343]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [344]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [345]:
 df.loc['B','Y']

-0.8480769834036315

In [346]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [347]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

PART 2

In [348]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [349]:
booldf =df > 0

In [350]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [351]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [352]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [353]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [354]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [355]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [356]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [357]:
resultdf=df[df['W']>0]

In [358]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [359]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [360]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [361]:
boolds=df['W']>0

In [362]:
res=df[boolds]
mycols=['Y','X']
res[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

THIS IS NOT PERMANTENT REINDEXING TO DO IT PERMANANETLY DO THE INPLACE=TRUE

In [363]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [364]:
newind='CA NY WY OR CO'.split()

In [365]:
newind
df['states']=newind

In [366]:
df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

***************INORDER TO THE CONDITIONAL OR THE AND OR STATEMENT IN THE DATAFRAMES WE USE HTE& AND  |************************

In [367]:
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z states
E  0.190794  1.978757  2.605967  0.683509     CO

In [368]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [369]:
#DATAFRAMES 3

In [370]:
outside=['G1','G1','G1','G2','G2','G2']

In [371]:
inside=[1,2,3,1,2,3]

In [372]:
hier_index=list(zip(outside,inside))

In [373]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [374]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [375]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [376]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [377]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [378]:
df.loc['G1'].iloc[2]

A   -0.134841
B    0.390528
Name: 3, dtype: float64

In [379]:
df.loc['G1'].loc[3]

A   -0.134841
B    0.390528
Name: 3, dtype: float64

In [380]:
df.index.names=['Groups','Num']

In [381]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [382]:
df.loc['G2'].loc[2].loc['B']

0.07295967531703869

In [383]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [384]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [385]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [386]:
df.xs(3,level='Num')

               A         B
Groups
G1     -0.134841  0.390528
G2      0.638787  0.329646

In [387]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [388]:
###############PANDAS -->MISSING DATA ########################

In [389]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [390]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [391]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [392]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [393]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [394]:
df.fillna(value='Missing')

         A        B  C
0      1.0      5.0  1
1      2.0  Missing  2
2  Missing  Missing  3

In [395]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [396]:
df.fillna(value=df['A'].min())

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [397]:
#####################---------------GROUP BY-----------------------

In [398]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [399]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [400]:
df=pd.DataFrame(data)

In [401]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [402]:
df.groupby('Company')

In [403]:
by_comp = df.groupby("Company")

In [404]:
# Select numeric columns
by_comp = numeric_columns.groupby("Company").std()
print(by_comp)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [405]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [406]:
df.groupby("Company").sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [407]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [408]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

MERGING JOINING AND CONCATENATION

In [1]:
##operations

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [5]:
##selecting the data

In [9]:
df[(df['col2']>2) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [10]:
df['col2'].apply(lambda x:x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [11]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [12]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [13]:
##in the above one the index remains the same

In [14]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [15]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

PIVOT TABLE

In [20]:
cl=df.pivot_table(values='D',index=['A','B'],columns=['C'])
cl

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [19]:
cl.fillna(value='MISSING')

C              x        y
A   B
bar one      4.0      1.0
    two  MISSING      5.0
foo one      1.0      3.0
    two      2.0  MISSING

INPUT AND THE OUTPUT

 CSV
 EXCEL
 HTML
 SQL

In [21]:
pwd

'E:\\'

In [23]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
df=pd.read_csv('example')

In [25]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [26]:
df.to_csv('pruthvij',index=False)

In [27]:
pd.read_csv('pruthvij')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [30]:
df.to_excel('prexcel.xlsx',sheet_name='NewSheet')

In [34]:
df = pd.read_excel('prexcel.xlsx', sheet_name='NewSheet')

In [35]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15